{"data":{"markdownRemark":{"html":"<p>\n  <figure class=\"gatsby-resp-image-figure\" style=\"\">\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 1100px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 66.66666666666666%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAGAAAAwEBAAAAAAAAAAAAAAAAAAQFAgP/xAAWAQEBAQAAAAAAAAAAAAAAAAAAAQL/2gAMAwEAAhADEAAAAZ7MnY0cCb//xAAaEAEAAgMBAAAAAAAAAAAAAAABAAIDERMi/9oACAEBAAEFAjIQ9CaZW9qzqs//xAAYEQACAwAAAAAAAAAAAAAAAAAAAREhQf/aAAgBAwEBPwFRpR//xAAYEQACAwAAAAAAAAAAAAAAAAAAAQIhQf/aAAgBAgEBPwFuWFn/xAAXEAEBAQEAAAAAAAAAAAAAAAAAIQEQ/9oACAEBAAY/Ak7NV//EABcQAQEBAQAAAAAAAAAAAAAAAAEAETH/2gAIAQEAAT8hz8YO4cZ3GJHWJVuFv//aAAwDAQACAAMAAAAQ3A//xAAXEQEBAQEAAAAAAAAAAAAAAAABACER/9oACAEDAQE/ECXEveX/xAAXEQADAQAAAAAAAAAAAAAAAAAAASER/9oACAECAQE/EMVCmn//xAAcEAACAgIDAAAAAAAAAAAAAAABEQAhMUFRYZH/2gAIAQEAAT8QXku2KqBWkCo8JiHUYO9GvIpPLxP/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"fire.jpg\"\n        title=\"Photo by https://unsplash.com/photos/HCCJgI4YwbQ\"\n        src=\"/static/fire-2047286e866179e69fc2e847d584d29f-80a2a.jpg\"\n        srcset=\"/static/fire-2047286e866179e69fc2e847d584d29f-49da2.jpg 275w,\n/static/fire-2047286e866179e69fc2e847d584d29f-8cc5e.jpg 550w,\n/static/fire-2047286e866179e69fc2e847d584d29f-80a2a.jpg 1100w,\n/static/fire-2047286e866179e69fc2e847d584d29f-d6076.jpg 1650w,\n/static/fire-2047286e866179e69fc2e847d584d29f-25733.jpg 2200w,\n/static/fire-2047286e866179e69fc2e847d584d29f-7c033.jpg 3000w\"\n        sizes=\"(max-width: 1100px) 100vw, 1100px\"\n      />\n    </span>\n  </span>\n  \n  <figcaption class=\"gatsby-resp-image-figcaption\">Photo by https://unsplash.com/photos/HCCJgI4YwbQ</figcaption>\n  </figure>\n      </p>\n<p>We use <a href=\"https://www.firebase.com\">Firebase</a> at <a href=\"https://yours.co\">Yours.co</a> for our entire backend. Our app depends upon cloud functions, datastore, push notifications and more.</p>\n<p>Firebase is well-suited to certain types of real-time applications. But, sometimes people ask me \"Should I use Firebase?\" Here are my open thoughts on Firebase's products and how they fit into a product's strategy.</p>\n<h2>A few caveats</h2>\n<ul>\n<li><a href=\"https://yours.co\">Our use case</a> is not your use case. Firebase can be well-suited to other applications.</li>\n<li>We don't use Firebase Cloud Firestore. It might be a lot better than their original Cloud Datastore product.</li>\n<li>Firebase is always getting better. Check <a href=\"https://www.firebase.com\">Firebase</a> to decide if it's a good fit for your needs.</li>\n</ul>\n<h2>Firebase: The Good Parts</h2>\n<p>Firebase is excellent for getting a product prototype or MVP off the ground. They take care of running your back end, and provide <a href=\"https://firebase.google.com/products/\">a suite of good services</a> for advanced features. They offer real-time syncing with your app, push notifications, and more. If you invest in the Firebase ecosystem, you can get up and running fast with very little overhead. You don't have to worry about managing servers and infrastructure. You also get Google's security and infrastructure teams supporting your product.</p>\n<p>Firebase also has a huge user community to bounce ideas off of and get guidance on best practices. Having an ecosystem around your technology decisions may help you move faster. Others may have already had the same problem and shared their solution to it with the world.</p>\n<p><strong>This might be good enough for many products, and these are great tools to use when you need them.</strong></p>\n<h2>Firebase: The problem</h2>\n<p>Unfortunately, many applications suffer from significant real-world constraints:</p>\n<ul>\n<li>Firebase's most advanced features introduce tight coupling between your app and database</li>\n<li>Firebase can make it hard to evolve your product.</li>\n<li>Firebase makes it hard to be backwards compatible</li>\n<li>Datastore makes updating complex data structures harder than alternatives like relational databases</li>\n<li>Firebase introduces significant lock-in with each component. This is a double-edged sword.</li>\n</ul>\n<p>These are the top points I would urge potential Firebase customers to consider.</p>\n<p>No technology is perfect. <em>Firebase might be the best solution to your specific situation</em>. Weigh your project's constraints against technology options. What can your team get done? What do you think you need to get done in the future?</p>\n<h2>Tight Coupling</h2>\n<p>Tight coupling is the biggest issue. It is the root of most of the problems listed above. Tight coupling means that a change to one part of an application triggers changes in other parts. A good example of this in the physical world would be a car with wheels welded to the axle. You couldn't change a tire without replacing the axles.</p>\n<p>Early technical decisions have huge impacts in the long-term path of the product. It's important to <strong>keep your options open</strong> and recognize that <strong>things will change</strong> over time. Startups suffer from this problem more than established products. <strong>The need for future agility is proportional to future product uncertainty.</strong> To <a href=\"https://blog.ycombinator.com/tips-ship-early-and-often/\">ship early and ship often</a>, you must think about enabling future growth.</p>\n<p>Firebase encourages tight coupling. It encourages meshing your app's user interface with the database. Thus, you must consider user interface or schema changes together. Is it okay to update the user interface and backend at the same time? What if you maintain older versions? Tight coupling makes for poor backwards compatibility.</p>\n<p>Mobile apps tend to need backwards compatibility. If you expose an API for customers to consume, you definitely need to be backwards compatible. The apps at <a href=\"https://yours.co\">Yours.co</a> check their version with the latest supported version in Firebase. If you are no longer supported, the app locks up until the user updates to the latest version. For some use-cases this may be sub-optimal.</p>\n<p>Unless backwards compatibility does not matter, keep your app loosely coupled. Firebase makes this particular constraint very hard, if not impossible, to handle.</p>\n<p>This does not matter as much if you only ship a web application that is evergreen with your backend.</p>\n<h2>Updating complex data structures</h2>\n<p>Firebase datastore is a document database with a single document in it.<a name=\"sup1\" href=\"#footnote1\"><sup>1</sup></a> Document databases are great at handling unstructured data at massive scale for analytics. If you don't know the shape of your data in advance, document databases can be a terrific solution.</p>\n<p>Most applications rely on known data with known fields. We know that users will sign up with an email address. Users have connections with other users. Tweets are 280 characters long. When using a schemaless database like Firebase, your app must handle your schema. You are responsible for managing data integrity, not your database. This generally means that document databases are a weaker fit for many applications.</p>\n<p>Document databases fail to model relationships between entities. Relational databases have decades of optimizations for joining and filtering data and relationships. With a document database, it is up to the engineer to build poor replacements for joins and filters in your app. Let's suppose we used a document database to model Twitter or Mastodon. A user produces tweets, and users can see a stream of tweets from their followers.</p>\n<p>A relational database would have a table of tweets, a table of users, and a table of who follows whom. We model the relationships between entities with foreign keys. Although this has drawbacks at massive scale, for most apps it's a great start.</p>\n<p>A document database like Firebase could have a subkey for users and a subkey for tweets. This would give you all the tweets for all users. But, you would need to query every user to pull up usernames and profile pictures to go with each tweet. You could stuff user tweets inside each user, but you would need to query every user to make a global timeline. The compromise is to then copy every tweet into both places. But now you have two problems when you go to edit/update content.</p>\n<p>At Yours.co, keep collections of data separate and link them with references. We have a <code>users</code> collection that describes information about each user generally. We sprinkle little bits of user data throughout the application. This makes reading easier for the app at the expense of complex writes. <a href=\"https://en.wikipedia.org/wiki/Relational_database\">Relational databases</a> like Postgres or MariaDB are excellent at these common workloads. By contrast, document databases leave this work up to you and your application. This is more work for you, slower, and more error prone.</p>\n<p>This also makes it harder to keep data in sync. If I copy data like an email address in a few places, when the user updates their email I have to remember what to update. This does not scale well, especially as a team evolves and develops a product. Data governance problems become more complex under a document-oriented model.</p>\n<h2>Real-time is overpromised</h2>\n<p>Firebase's killer feature is realtime data. It feels like magic to edit something on the client side and see it update in real time in a different part of the app. Firebase makes this possible, for free, out of the box. But, if you face any of the above constraints, you may not get the real-time features you expect. Firebase's real-time features only work if you mesh your UI with the data model. If you want to use an API in front of Firebase, you have to re-implement your own realtime features in some other way. Firebase's realtime features are also data-oriented rather than application-level events. Instead of reacting to \"A user registered\" you would see \"Inserted an object in /users\".</p>\n<h2>Lock-in</h2>\n<p>Firebase offers a suite of tools from database to A/B testing and more. The entire suite is impressive, and we use several components at Yours.co to make our app work. Despite the above complaints, <strong>Firebase may be a good fit for some projects</strong>. That said, Firebase is a business built around getting you linked to a community of products. If you buy into authentication, you will want to use firestore or datastore. When you need to store uploaded user files, Firebase Storage is a convenient option. A/B testing, crash reporting, push notifications, and more are also a few clicks away.</p>\n<p>This convenience is not a bad thing. This is why Firebase can be a great tool for the right product. Before you commit to part of firebase, are you okay with the rest of the products in the Firebase ecosystem? Is the lock-in worth not writing it yourself? Weighing such trade offs is the essence of good software engineering and architecture.</p>\n<h2>When to use Firebase</h2>\n<p>I would recommend Firebase to new, greenfield projects that:</p>\n<ul>\n<li>Know what they need to achieve a good MVP out of the gate</li>\n<li>Don't want to fiddle with infrastructure concerns</li>\n<li>Are web-based only/Don't need backwards compatibility</li>\n<li>Have a small-ish team</li>\n</ul>\n<h2>What I recommend instead of Firebase</h2>\n<p>I recommend the technology a team is most comfortable with. I recommend the following for the good parts of Firebase without using Firebase.</p>\n<h3>Elixir + Phoenix</h3>\n<p>Elixir and Phoenix offer an incredible <a href=\"https://phoenixframework.org/blog/the-road-to-2-million-websocket-connections\">concurrency and scaling</a> story. It enables real-time websockets in a way that is scalable and performant. It provides a rock-solid foundation for building your own apps. You can also <a href=\"https://hexdocs.pm/phoenix/heroku.html#content\">run it on Heroku</a> if you don't want to run your own infrastructure.</p>\n<h3>Postgres</h3>\n<p><a href=\"https://www.postgresql.org/\">Postgres</a> is a rock solid relational database that is fast, efficient, and supports many modern features. It can store JSON if you want the flexibility of a document database. It does geographic calculations if that's your need. It supports everything from relational databases. It can even do <a href=\"https://blog.lelonek.me/listen-and-notify-postgresql-commands-in-elixir-187c49597851\">realtime events</a> similar to Firebase.</p>\n<h3>GraphQL</h3>\n<p>GraphQL APIs are an alternative to REST APIs. They are strongly typed, self-documenting, and let you query exactly what you need. I am a fan of <a href=\"https://absinthe-graphql.org/\">Absinthe GraphQL</a> for the backend and <a href=\"https://www.apollographql.com/\">Apollo</a> on the frontend.<a name=\"sup2\" href=\"#footnote2\"><sup>2</sup></a> It also supports realtime out of the box using Subscriptions.</p>\n<p>GraphQL decouples the backend from the frontend. It can version and deprecate fields for backwards compatibility concerns. It enables tying in the best backend for the job.</p>\n<h3>Summary</h3>\n<ul>\n<li>Firebase is great for some use-cases</li>\n<li>Try to go into it with eyes wide open</li>\n<li>If your data is not a good fit for a document database, be careful!</li>\n<li>Consider alternatives that will grow with you for longer</li>\n</ul>\n<h2>Footnotes</h2>\n<p><a name=\"footnote1\" href=\"#sup1\">1</a>: I have not used Firebase Firestore yet (it's still in beta), but it doesn't seem to include relational indices either.\n<a name=\"footnote2\" href=\"#sup2\">2</a>: I have tried Apollo Server. If you want cutting-edge features or are all-in on Node, it's a good option. I find Absinthe is elegant and declarative. Elixir and Phoenix handle realtime subscriptions well too.</p>","frontmatter":{"date":"October 15, 2018","title":"The problem with Firebase"},"fields":{"slug":"/blog/2018-10-15-firebase-problem/"}}},"pageContext":{}}