{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"b07d1178-d8b0-519b-8faf-49b5d90964fe","fields":{"slug":"/blog/2019-03-18-resilience-and-tolerance/"},"excerpt":"From  https://seths.blog/2019/03/resilience-and-tolerances/ You’ll probably find that while precision feels like the way forward, resilience, the ability to thrive when things go wrong, is a much safer bet. Although Seth is famous for writing about…","frontmatter":{"date":"March 18, 2019","title":"Resilience and Tolerance"}}},{"node":{"id":"b5b61d30-3562-5dfa-9065-c8e1a8169d7a","fields":{"slug":"/blog/2019-03-04-typescript-ftw/"},"excerpt":"Today, I've decided that I prefer Typescript to Javascript. I think it offers great features and protection without the hassle of an overly prescriptive strongly-type langauge, and it has made writing software for Lambda School much more effective.","frontmatter":{"date":"March 04, 2019","title":"Typescript FTW"}}},{"node":{"id":"b68c5fb3-335d-546e-adaf-a893dd3cf600","fields":{"slug":"/blog/2019-01-7-how-to-read-notes/"},"excerpt":"These are some unstructured notes from a  free video  published by\n Farnam Street  on how to read. These notes are just a loose\ncollection, so don't take them as definitive or even complete, but they seemed\nuseful. Read from multiple perspectives…","frontmatter":{"date":"January 07, 2019","title":"Notes on \"How to Read\""}}},{"node":{"id":"1f352837-9fdc-50a4-a6d6-6ca35c863860","fields":{"slug":"/blog/2018-10-24-tim-cook-privacy/"},"excerpt":"I recently read Tim Cook's inspiring remarks on privacy. If you haven't read it yet, I encourage you to  check it out . As I have reflected on his message, one thing stood out: Technology must be infused with our humanity. That requires human…","frontmatter":{"date":"October 24, 2018","title":"Tim Cook on Privacy"}}},{"node":{"id":"a4b3fae9-f064-54a7-a945-634f80bbd5ab","fields":{"slug":"/blog/2018-10-15-firebase-problem/"},"excerpt":"We use  Firebase  at  Yours.co  for our entire backend. Our app depends upon cloud functions, datastore, push notifications and more. Firebase is well-suited to certain types of real-time applications. But, sometimes people ask me \"Should I use…","frontmatter":{"date":"October 15, 2018","title":"The problem with Firebase"}}},{"node":{"id":"98b8a960-9fc7-534b-a055-35f3276df3dd","fields":{"slug":"/blog/2018-10-08-event-sourcing/"},"excerpt":"Note: This article is still a draft, hence the blank sections at the bottom. Thanks for stopping by either way! I am fascinated by pushing the boundaries of software. A few years ago, I read  this marvelous piece about Logs  - not messages for…","frontmatter":{"date":"October 12, 2018","title":"Event Sourcing for Beginners"}}},{"node":{"id":"6bb171e1-7c3d-5fe5-a2fd-98736308dcb7","fields":{"slug":"/blog/2019-02-13-journal-entry/"},"excerpt":"In my efforts to not burdened Bob with too many questions, I think I made a mistake today. Which is to say yesterday. In working on getting our  atlas-db  package upgraded to Version 3.0, I discovered that we needed to make some adjustments to the…","frontmatter":{"date":"October 12, 2018","title":"When you write a script that you didn't need"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}